       01  WS-DATE-SUBFIELDS REDEFINES WS-DATE.
           05  WS-DATE-YYYY      PIC 9(4).
           05  WS-DATE-MM        PIC 9(2).
           05  WS-DATE-DD        PIC 9(2).
