       FD  BRANCH-FILE.
       01  BR-REC.
           05  BR-REC-CODE         PIC X(3).
           05  BR-REC-NAME-KANJI   PIC X(40).
           05  BR-REC-NAME-KANA    PIC X(40).
           05  BR-REC-REGION       PIC X(20).
           05  BR-REC-OPENED-DATE  PIC 9(8).
           05  BR-REC-STATUS       PIC X(1).
           05  BR-REC-FILLER       PIC X(20).
