       FD  BR-SEED-FILE.
       01  BS-REC.
           05  BS-CODE         PIC X(3).
           05  BS-NAME-KANJI   PIC X(40).
           05  BS-NAME-KANA    PIC X(40).
           05  BS-REGION       PIC X(20).
           05  BS-OPENED-DATE  PIC 9(8).
           05  BS-STATUS       PIC X(1).
           05  BS-FILLER       PIC X(20).
