       SD  SORT-WORK-FILE.
       01  SORT-WORK-REC.
           05  SR-PAYER-ACCT            PIC X(13).
           05  SR-SEQ                   PIC 9(10).
           05  SR-FULL-RECORD           PIC X(600).
