       FD  CALENDAR-FILE.
       01  CAL-REC.
           05  CAL-REC-DATE         PIC 9(8).
           05  CAL-REC-DAY-TYPE     PIC X(1).
           05  CAL-REC-HOLIDAY-NAME PIC X(40).
           05  CAL-REC-FILLER       PIC X(11).
