       FD  FS-SEED-FILE
           RECORD CONTAINS 41 CHARACTERS.
       01  FS-SEED-REC.
           05  FSS-CATEGORY     PIC 9(2).
           05  FSS-TIER         PIC 9(2).
           05  FSS-EFF-FROM     PIC 9(8).
           05  FSS-TIER-MIN     PIC S9(15) COMP-3.
           05  FSS-TIER-MAX     PIC S9(15) COMP-3.
           05  FSS-AMOUNT       PIC S9(9) COMP-3.
           05  FSS-EFF-TO       PIC 9(8).
